.emacs.d/sakura.org
*** Org-Ref
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package org-ref
  :after (:any org org-noter org-roam)
  :config
  (setq reftex-default-bibliography BIBLIOGRAPHY)

  (setq org-ref-bibliography-notes "~/Notebook/index.org")
  (setq org-ref-default-bibliography '("~/texmf/bibtex/bib/master.bib"))
  (setq org-ref-pdf-directory "~/Dropbox/Library")
  (setq org-ref-completion-library 'helm-bibtex)
  (setq org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex)
  (setq org-ref-note-title-format "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n")
  (setq org-ref-notes-directory "~/Notebook")
  (setq org-ref-notes-function 'orb-edit-notes))

  (setq bibtex-completion-bibliography BIBLIOGRAPHY)
  (setq bibtex-completion-library-path LIBRARY)
  (setq bibtex-completion-notes-path NOTEBOOK)

(sakura/leader-key-def
  "nbb" '(helm-bibtex :which-key "helm-bibtex")
  "nbn" '(helm-bibtex-with-notes :which-key "helm-bibtex-with-notes"))
#+END_SRC

*** Org-Roam
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package org-roam
  :ensure t
  :hook (after-init . org-roam-mode)
  :config
  (setq org-roam-directory NOTEBOOK))

(sakura/leader-key-def
  "nr" '(:ignore t :which-key "roam")
  "nrr" '(org-roam :which-key "org-roam")
  "nrf" '(org-roam-find-file :which-key "org-roam-find-file")
  "nrg" '(org-roam-graph-show :which-key "org-roam-graph-show")
  "nri" '(org-roam-insert :which-key "org-roam-insert")
  "nrI" '(org-roam-insert-immediate :which-key "org-roam-insert-immediate"))
#+END_SRC

*** Org-Roam-Protocol
#+begin_src emacs-lisp :tangle "./init.el"
(require 'org-roam-protocol)
#+end_src

*** Org-Roam-Server
#+begin_src emacs-lisp :tangle "./init.el"
(use-package org-roam-server
  :ensure t
  :config
  (setq org-rome-server-host "127.0.0.1"
	org-roam-server-port 8080
	org-roam-server-authenticate nil
	org-roam-server-export-inline-images t
	org-roam-server-files nil
	org-roam-server-served-file-extensions '("pdf" "md" "tex" "bib")
	org-roam-server-network-poll t
	org-roam-server-network-arrows nil
	org-roam-server-network-label-truncate t
	org-roam-server-label-truncate-length 60
	org-roam-server-network-label-wrap-length 20))

(sakura/leader-key-def
  "nrv" '(org-roam-server-mode :which-key "visualize roam"))
#+end_src

*** Org-Roam-BibTeX
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package org-roam-bibtex
  :after (org-roam)
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
  (setq org-roam-bibtex-preformat-keywords
        '("=key=" "title" "url" "file" "author-or-editor" "keywords"))
  (setq orb-templates
        '(("r" "ref" plain (function org-roam-capture--get-point)
           ""
           :file-name "${slug}"
           :head "#+TITLE: ${=key=}: ${title}\n#+ROAM_KEY: ${ref}

- tags ::
- keywords :: ${keywords}

\n* ${title}\n  :PROPERTIES:\n  :Custom_ID: ${=key=}\n  :URL: ${url}\n  :AUTHOR: ${author-or-editor}\n  :NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n  :NOTER_PAGE: \n  :END:\n\n"

           :unnarrowed t))))

(sakura/leader-key-def
  "nba" '(orb-note-actions :which-key "orb-note-actions"))
#+END_SRC

*** PDF-Tools
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package pdf-tools
  :if (display-graphic-p)
  :mode ("\\.pdf$" . pdf-view-mode)
  :init (load "pdf-tools-autoloads" nil t)
  :config
  (pdf-tools-install)
  (setq-default pdf-view-display-size 'fit-width)
  (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0))))
#+END_SRC

*** Powerthesaurus
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package powerthesaurus)

(sakura/leader-key-def
  "nt" '(powerthesaurus-lookup-word-dwim :which-key "powerthesaurus"))
#+END_SRC

*** Zotxt
#+begin_src emacs-lisp :tangle "./init.el"
(use-package zotxt
  :hook (after-init . org-zotxt-mode))
(sakura/leader-key-def
  "z"   '(:ignore t :which-key "zotero")
  "zi"  '(org-zotxt-insert-reference-link :which-key "insert reference")
  "zo"  '(org-zotxt-open-attachment :which-key "open attachment")
  "zu"  '(org-zotxt-update-reference-link-at-point :which-key "update reference")
  "zn"  '(org-zotxt-noter :which-key "take notes"))
#+end_src

** Programming
*** General Configuration
#+begin_src emacs-lisp :tangle "./init.el"
(use-package smartparens)
(require 'smartparens-config)
#+end_src

*** Markdown
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package markdown-mode
  :pin melpa-stable
  :mode "\\.md\\'"
  :config
  (setq markdown-command "marked"))
#+END_SRC

*** Python
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package elpy
  :ensure t
  :init
  (elpy-enable))
(setq python-shell-interpreter "python3")
(setq py-shell-name "python3")
(setq py-python-command "python3")

(use-package company
  :diminish company-mode
  :init
  (global-company-mode)
  :config
  (setq company-backends 
        '((company-files
           company-keywords
	   company-capf)
	   (company-abbrev company-dabbrev)
           )))

(use-package company-quickhelp
  :config
  (company-quickhelp-mode))
#+END_SRC

*** Rust
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package rust-mode)
(use-package cargo)
(add-hook 'rust-mode-hook 'cargo-minor-mode)
(add-hook 'rust-mode-hook
	  (lambda ()
	    (local-set-key (kbd "C-c <tab>") #'rust-format-buffer)))
(use-package racer
  :config
  (setq racer-cmd "~/.cargo/bin/racer/")
  (setq racer-rust-src-path "~/.rustup/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/"))

(add-hook 'rust-mode-hook #'racer-mode)
(add-hook 'rust-mode-hook #'smartparens-mode)
(add-hook 'racer-mode-hook #'eldoc-mode)
(add-hook 'racer-mode-hook #'company-mode)

(use-package flycheck-rust)
(add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
#+END_SRC

* Theming
** Doom Themes
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq custom-theme-load-path '("~/.emacs.d/themes/"))
(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
	doom-themes-enable-italic t)
  (load-theme 'doom-sakura-light t)
  (doom-themes-visual-bell-config))
#+END_SRC

** Light Theme
*** Theme Definitions
#+BEGIN_SRC emacs-lisp :tangle "./themes/doom-sakura-light-theme.el"
(require 'doom-themes)

(defgroup doom-sakura-light-theme nil
  "Options for doom-themes"
  :group 'doom-themes)

(def-doom-theme doom-sakura-light
  "A pleasant light theme, soft as a cherry blossom."

  ;; name           default     256         16
  ( (bg           '("#FBF7EF"   "#FBF7EF"   "white"))
    (bg-alt       '("#FBF7EF"   "#FBF7EF"   "white"))
    (base0        '("#363636"   "#363636"   "black"))
    (base1        '("#414141"   "#414141"   nil))
    (base2        '("#BF9B9F"   "#BF9B9F"   nil))
    (base3        '("#ebe6ea"   "#EBE6EA"   nil)) ;; block highlights
    (base4        '("#C9678D"   "#C9678D"   nil))
    (base5        '("#ECA7D5"   "#ECA7D5"   nil))
    (base6        '("#C9678D"   "#C9678D"   nil))
    (base7        '("#E7CEEE"   "#E7CEEE"   nil))
    (base8        '("#E2D8F5"   "#E2D8F5"   nil))
    (fg           '("#2A2A2A"   "#2A2A2A"   nil))
    (fg-alt       '("#2A2A2A"   "#2A2A2A"   nil))

    (grey base6)
    (red          '("#BE3445"   "#BE3445"   nil))
    (orange       '("#D36745"   "#D36745"   nil))     
    (green        '("#AAC275"   "#BE3445"   nil))
    (yellow       '("#E1B967"   "#E1B967"   nil))
    (magenta      '("#CE67CF"   "#CE67CF"   nil))

    (teal         '("#29838D"   "#29838D"   nil))
    (blue         '("#3B6EA8"   "#3B6EA8"   nil))
    (dark-blue    '("#5272AF"   "#5272AF"   nil))
    (violet       '("#842879"   "#842879"   nil))
    (cyan         '("#398EAC"   "#398EAC"   nil))
    (dark-cyan    '("#2C7088"   "#2C7088"   nil))

    ;; face categories -- required for all themes
    (highlight          (doom-blend blue bg 0.8))
    (vertical-bar       (doom-darken bg 0.15))
    (selection          (doom-blend blue bg 0.5))
    (builtin            teal)
    (comments           (doom-darken base5 0.2))
    (doc-comments       (doom-darken base5 0.25))
    (constants          magenta)
    (functions          teal)
    (keywords           blue)
    (methods            teal)
    (operators          blue)
    (type               yellow)
    (strings            green)
    (variables          violet)
    (numbers            magenta)
    (region             base4)
    (error              red)
    (warning            yellow)
    (success            green)
    (vc-modified        orange)
    (vc-added           green)
    (vc-deleted         red)
    (hl-line            base6)
    (cursor-color       '("#000000"))
    (+evil--default-cursor-color '("#000000"))
    (modeline-fg        nil)))

(defvar blink-cursor-colors (list  "#92c48f" "#6785c5" "#be369c" "#d9ca65")
  "On each blink the cursor will cycle to the next color in this list.")

(setq blink-cursor-count 0)
(defun blink-cursor-timer-function ()
  "Zarza wrote this cyberpunk variant of timer `blink-cursor-timer'. 
Warning: overwrites original version in `frame.el'.

This one changes the cursor color on each blink. Define colors in `blink-cursor-colors'."
  (when (not (internal-show-cursor-p))
    (when (>= blink-cursor-count (length blink-cursor-colors))
      (setq blink-cursor-count 0))
    (set-cursor-color (nth blink-cursor-count blink-cursor-colors))
    (setq blink-cursor-count (+ 1 blink-cursor-count))
    )
  (internal-show-cursor nil (not (internal-show-cursor-p))))
#+END_SRC

