.emacs.d/sakura.org
*** Font Tweaks
#+begin_src emacs-lisp :tangle "./init.el"
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))

(custom-theme-set-faces
 'user
  `(org-document-info-keyword ((t :foreground "#9F9F9F")))

  `(org-level-1 ((t :foreground "#2a2a2a" :weight bold)))
  `(org-level-2 ((t :foreground "#2a2a2a" :weight bold)))
  `(org-level-3 ((t :foreground "#2a2a2a" :weight normal)))
  `(org-level-4 ((t :foreground "#2a2a2a" :weight normal)))
  `(org-level-5 ((t :foreground "#2a2a2a" :weight normal)))
  `(org-level-6 ((t :foreground "#2a2a2a" :weight normal)))
  `(org-level-7 ((t :foreground "#2a2a2a" :weight normal)))
  `(org-level-8 ((t :foreground "#2a2a2a" :weight normal)))
  `(org-level-9 ((t :foreground "#2a2a2a" :weight normal)))

  `(org-block            ((t :inherit 'fixed-pitch)))
  `(org-block-begin-line ((t :foreground "#BF9B9F" :background nil :underline "#2A2A2A")))
  `(org-block-end-line   ((t :foreground "#BF9B9F" :background nil :underline nil :overline "#2A2A2A")))
  `(org-verbatim         ((t :foreground "#BE3445" :background nil :weight normal)))

  `(org-table            ((t :background "#FBF7EF")))
  `(org-formula          ((t :background "#FBF7EF")))
  `(org-ref-cite-face    ((t :foreground "#BE3445")))
  `(org-drawer           ((t :foreground "#9F9F9F")))

  `(ivy-current-match    ((t :foreground "#2A2A2A"))))

#+end_src

*** Other Tweaks
#+begin_src emacs-lisp :tangle "./init.el"
(set-frame-parameter (selected-frame) 'alpha '(85 85))
(add-to-list 'default-frame-alist '(alpha 85 85))
#+end_src

** Dark Theme
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
#+END_SRC

* Inspirations
- [[https://github.com/howardabrams/dot-files][Howard Abrams]]
- [[https://github.com/daedreth/UncleDavesEmacs/blob/master/config.org][Uncle Daves Emacs]]
- [[https://github.com/dakrone/dakrone-dotfiles/blob/master/emacs.org][Dakrone]]
- [[https://github.com/jinnovation/dotemacs][Jinnovation]]
- [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][Daviwil]]
- [[https://writequit.org/org/][Writequit]]
- [[https://doc.rix.si/cce/cce.html][Complete Computing Environment]]


